<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'نام',
    'column.guard_name' => 'Guard Name',
    'column.roles' => 'نقش ها',
    'column.permissions' => 'مجوز ها',
    'column.updated_at' => 'بروزرسانی شده در',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'نام',
    'field.guard_name' => 'Guard Name',
    'field.permissions' => 'مجوز ها',
    'field.select_all.name' => 'انتخاب همه',
    'field.select_all.message' => 'تمام مجوز های موجود را برای این نقش <span class="text-primary font-medium">فعال</span> کنید',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'سطوح دسترسی',
    'nav.role.label' => 'نقش ها',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'نقش ها',
    'resource.label.roles' => 'نقش ها',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'موجودیت ها',
    'resources' => 'منابع',
    'widgets' => 'ویجت ها',
    'pages' => 'صفحات',
    'custom' => 'مجوزهای سفارشی',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'شما اجازه دسترسی ندارید',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'نمایش',
        'view_any' => 'نمایش همه',
        'create' => 'ایجاد',
        'update' => 'تجدید',
        'delete' => 'حذف',
        'delete_any' => 'حذف همه',
        'force_delete' => 'حذف اجباری',
        'force_delete_any' => 'حذف اجباری همه',
        'restore' => 'بازیابی',
        'replicate' => 'تکرار',
        'reorder' => 'مرتب دوباره',
        'restore_any' => 'بازیابی همه',
    ]
];
