<?php

return [
    "login" => [
        "username_or_email" => "نام کاربری یا ایمیل",
        "forgot_password_link" => "رمز عبور را فراموش کرده اید؟",
        "create_an_account" => "یک حساب کاربری ایجاد کنید",
    ],
    "password_confirm" => [
        "heading" => "رمز عبور را تایید کنید",
        "description" => "لطفاً رمز عبور خود را برای تکمیل این اقدام تأیید کنید.",
        "current_password" => "رمز عبور فعلی"
    ],
    "two_factor" => [
        "heading" => "احراز هویت دو عاملی",
        "description" => "لطفاً با وارد کردن کد احراز هویت ارائه شده توسط برنامه احراز هویت خود، دسترسی به حساب خود را تأیید کنید.",
        "code_placeholder" => "XXX-XXX",
        "recovery" => [
            "heading" => "احراز هویت دو عاملی",
            "description" => "لطفاً با وارد کردن یکی از کدهای بازیابی اضطراری خود، دسترسی به حساب خود را تأیید کنید.",
        ],
        "recovery_code_placeholder" => "abcdef-98765",
        "recovery_code_text" => "دستگاه گم شده؟",
        "recovery_code_link" => "از کد بازیابی استفاده کنید",
        "back_to_login_link" => "بازگشت به صفحه ورود"
    ],
    "registration" => [
        "title" => "ثبت نام",
        "heading" => "ایجاد یک حساب کاربری جدید",
        "submit" => [
            "label" => "ثبت نام",
        ],
        "notification_unique" => "یک حساب با این ایمیل از قبل وجود دارد. لطفا وارد شوید.",
    ],
    "reset_password" => [
        "title" => "رمز عبور را فراموش کرده اید",
        "heading" => "رمز عبور خود را بازنشانی کنید",
        "submit" => [
            "label" => "ارسال",
        ],
        "notification_error" => "خطا در بازنشانی رمز عبور. لطفاً بازنشانی رمز عبور جدید را درخواست کنید.",
        "notification_error_link_text" => "دوباره امتحان کنید",
        "notification_success" => "صندوق ورودی خود را برای دستورالعمل بررسی کنید!",
    ],
    "verification" => [
        "title" => "تأیید ایمیل",
        "heading" => "تأیید ایمیل مورد نیاز است",
        "submit" => [
            "label" => "خروج از سیستم",
        ],
        "notification_success" => "صندوق ورودی خود را برای دستورالعمل بررسی کنید!",
        "notification_resend" => "ایمیل تأیید دوباره ارسال شد.",
        "before_proceeding" => "قبل از ادامه، لطفاً ایمیل خود را برای پیوند تأیید بررسی کنید.",
        "not_receive" => "اگر ایمیل را دریافت نکردید،",
        "request_another" => "برای درخواست یکی دیگر اینجا را کلیک کنید",
    ],
    "profile" => [
        "account" => "سطوح دسترسی",
        "profile" => "پروفایل",
        "my_profile" => "پروفایل",
        "personal_info" => [
            "heading" => "اطلاعات شخصی",
            "subheading" => "اطلاعات شخصی خود را مدیریت کنید",
            "submit" => [
                "label" => "به روز رسانی",
            ],
            "notify" => "نمایه با موفقیت به روز شد!",
        ],
        "password" => [
            "heading" => "کلمه عبور",
            "subheading" => "باید 8 کاراکتر باشد.",
            "submit" => [
                "label" => "به روز رسانی",
            ],
            "notify" => "رمز عبور با موفقیت به روز شد!",
        ],
        "2fa" => [
            "title" => "احراز هویت دو عاملی",
            "description" => "احراز هویت 2 عاملی را برای حساب خود مدیریت کنید (توصیه می شود).",
            "actions" => [
                "enable" => "فعال کردن",
                "regenerate_codes" => "بازسازی کدها",
                "disable" => "غیر فعال کردن",
                "confirm_finish" => "تایید کنید و تمام کنید",
                "cancel_setup" => "راه اندازی را لغو کنید"
            ],
            "setup_key" => "کد راه اندازی",
            "not_enabled" => [
                "title" => "شما احراز هویت دو عاملی را فعال نکرده اید.",
                "description" => "هنگامی که احراز هویت دو عاملی فعال باشد، در حین احراز هویت از شما خواسته می شود که یک کد امن و تصادفی داشته باشید. می توانید این نشانه را از برنامه Google Authenticator گوشی خود بازیابی کنید."
            ],
            "finish_enabling" => [
                "title" => "فعال کردن احراز هویت دو عاملی را به پایان برسانید.",
                "description" => "برای پایان دادن به فعال کردن احراز هویت دو عاملی، کد QR زیر را با استفاده از برنامه احراز هویت گوشی خود اسکن کنید یا کلید تنظیم را وارد کرده و کد OTP تولید شده را ارائه دهید."
            ],
            "enabled" => [
                "title" => "شما احراز هویت دو عاملی را فعال کرده اید!",
                "description" => "احراز هویت دو عاملی اکنون فعال است. کد QR زیر را با استفاده از برنامه احراز هویت گوشی خود اسکن کنید یا کد تنظیم را وارد کنید.",
                "store_codes" => "این کدهای بازیابی را در یک نرم افزار مدیریت رمز عبور امن ذخیره کنید. اگر دستگاه احراز هویت دو عاملی شما گم شود، می توان از آنها برای بازیابی دسترسی به حساب شما استفاده کرد.",
                "show_codes" => 'نمایش کدهای بازیابی',
                "hide_codes" => 'پنهان کردن کدهای بازیابی'
            ],
            "confirmation" => [
                "success_notification" => 'کد تایید شد احراز هویت دو عاملی فعال شد.',
                "invalid_code" => "کدی که وارد کرده اید نامعتبر است."
            ]
        ],
        "sanctum" => [
            "title" => "API توکن",
            "description" => "توکن‌های API را مدیریت کنید که به سرویس‌های شخص ثالث اجازه می‌دهند از طرف شما به این برنامه دسترسی داشته باشند. توجه: رمز شما یک بار پس از ایجاد نشان داده می شود. اگر توکن خود را گم کردید، باید آن را حذف کرده و یک رمز جدید ایجاد کنید.",
            "create" => [
                "notify" => "توکن با موفقیت ایجاد شد!",
                "submit" => [
                    "label" => "ایجاد کردن",
                ],
            ],
            "update" => [
                "notify" => "رمز با موفقیت به روز شد!",
            ],
        ],
    ],
    "fields" => [
        "email" => "ایمیل",
        "login" => "وارد شدن",
        "name" => "نام کاربری",
        "password" => "رمز عبور",
        "password_confirm" => "تایید رمز عبور",
        "new_password" => "رمز عبور جدید",
        "new_password_confirmation" => "تایید رمز عبور",
        "token_name" => "نام توکن",
        "abilities" => "توانایی ها",
        "2fa_code" => "کد",
        "2fa_recovery_code" => "Recovery Code"
    ],
    "or" => "یا",
    "cancel" => "لغو"
];
